#+TITLE: Readme

WIP;

* Inspiration
https://muan.co/

* Architecture
#+begin_src bash :results drawer
cd ./src && fd . | as-tree
#+end_src

#+RESULTS:
:results:
.
в”њв”Ђв”Ђ app.d.ts
в”њв”Ђв”Ђ app.html
в”њв”Ђв”Ђ css
в”‚   в”њв”Ђв”Ђ _blocks.css
в”‚   в”њв”Ђв”Ђ _compositions.css
в”‚   в”њв”Ђв”Ђ _utilities.css
в”‚   в”њв”Ђв”Ђ blocks
в”‚   в”‚   в”њв”Ђв”Ђ box.css
в”‚   в”‚   в””в”Ђв”Ђ skip-link.svelte
в”‚   в”њв”Ђв”Ђ compositions
в”‚   в”‚   в”њв”Ђв”Ђ cluster.css
в”‚   в”‚   в”њв”Ђв”Ђ sidebar.css
в”‚   в”‚   в”њв”Ђв”Ђ stack.css
в”‚   в”‚   в””в”Ђв”Ђ switcher.css
в”‚   в”њв”Ђв”Ђ cube.css
в”‚   в”њв”Ђв”Ђ custom-props.css
в”‚   в”њв”Ђв”Ђ reset.css
в”‚   в””в”Ђв”Ђ utilities
в”‚       в”њв”Ђв”Ђ flow.css
в”‚       в”њв”Ђв”Ђ region.css
в”‚       в”њв”Ђв”Ђ splitter.css
в”‚       в”њв”Ђв”Ђ visually-hidden.css
в”‚       в””в”Ђв”Ђ wrapper.css
в”њв”Ђв”Ђ lib
в”‚   в”њв”Ђв”Ђ fetch.ts
в”‚   в”њв”Ђв”Ђ highlightDOM.ts
в”‚   в”њв”Ђв”Ђ layout
в”‚   в”‚   в”њв”Ђв”Ђ AboutCard.svelte
в”‚   в”‚   в”њв”Ђв”Ђ ContentBubbles.svelte
в”‚   в”‚   в”њв”Ђв”Ђ ContentHeader.svelte
в”‚   в”‚   в”њв”Ђв”Ђ Menu.svelte
в”‚   в”‚   в”њв”Ђв”Ђ SearchContentIcon.svelte
в”‚   в”‚   в”њв”Ђв”Ђ StickyBackground.svelte
в”‚   в”‚   в””в”Ђв”Ђ TagCard.svelte
в”‚   в”њв”Ђв”Ђ logic
в”‚   в”‚   в”њв”Ђв”Ђ About.svelte
в”‚   в”‚   в”њв”Ђв”Ђ ContentFeed.svelte
в”‚   в”‚   в”њв”Ђв”Ђ TagFeed.svelte
в”‚   в”‚   в””в”Ђв”Ђ ThemeSwitch.svelte
в”‚   в”њв”Ђв”Ђ paths.ts
в”‚   в”њв”Ђв”Ђ store.ts
в”‚   в””в”Ђв”Ђ xform.ts
в”њв”Ђв”Ђ params
в”‚   в”њв”Ђв”Ђ colon.ts
в”‚   в””в”Ђв”Ђ integer.ts
в”њв”Ђв”Ђ routes
в”‚   в”њв”Ђв”Ђ [slug=colon].svelte
в”‚   в”њв”Ђв”Ђ [slug=integer].svelte
в”‚   в”њв”Ђв”Ђ __layout.svelte
в”‚   в””в”Ђв”Ђ index.ts
в””в”Ђв”Ђ service-worker.ts
:end:

** api
*** client.ts
*** server.ts
** /routes
*** /index.svelte
- Counter.ts

** /hooks.ts - Run on every request
https://kit.svelte.dev/docs/hooks
** /lib/Counter.svelte
interesting [[https://svelte-motion.gradientdescent.de/][Svelte Motion]] example
-> $ displayed_count
-> $ offset (for negative numbers)

* Modules
** $app/env
import { amp, browser, dev, mode, prerendering } from '$app/env';
https://kit.svelte.dev/docs/modules#$app-env

* Receipts
** Client code
#+begin_src javascript
if (typeof window !== 'undefined') {
  // enter client side
}
#+end_src

* Open Todos
** Site-head (Nav) -> __layout
[[file:src/components/SiteHead.svelte][file:~/data/git/svelte/ja.nz/src/components/SiteHead.svelte]]

** routes
*** __error
[[file:src/routes/__error.svelte::// TODO Check offline capabilities][Offline capabilities]]
[[file:src/routes/__error.svelte::// TODO more status?][Error Codes]]
[[file:src/routes/__error.svelte::>TODO: Try searching for it here!</a][Search in content to escape 404]]
